csci2720/notesMaster.org
#+TITLE: Data Structures
#+AUTHOR: Sudhan Chitgopkar
#+EMAIL: sudhanchitgopkar@uga.edu
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="rethink.css" />
#+OPTIONS: toc:nil num:nil html-style:nil
* 02.08.21 - 02.09.21
** List ADT
- List consists of a domain and a set of operations
- Domain is composed of homogeneous elements
- Elements should be able to be compared (comparison operation must be defined)
- All elements except for the first and last elements have a predecessor and successor
- Sorted lists are always implied to be sorted in ascending order
- List operations
  - Constructor
  - Transformer: (changes state)
    - MakeEmpty, InsertItem,DeleteItem
  - Observer: (obsesrve state)
    - IsFull, LengthIs, Min, Max, Average
  - Iterator: GetNextItem (note that a ResetList is generally called before GetNextItem)
** Generic Data Type
- A generic data type is a type for which the operations are defined but the types of the items being manipulated are not defined
** Efficient Operations in Unsorted Lists
- When dealing with unsorted, array-based lists of a data-type,
  - insert operations should always be done at the end of the list through insert(length)
    - this is because inserting at the beginning requires us to push all items to the right one unit which is O(n), not O(1)
  - delete operations should (1) find the element, (2) delete the element, and (3) move the last term to the index of the deleted term
    - this allows us to prevent moving through the array and refactoring it post-deletion
 - Operation Complexity:
   - Search: O(n)
   - Insert: O(1)
   - Delete: O(n)
** Efficient Operations in Sorted Lists
- GetItem, PutItem, and DeleteItem implementations change
- For GetItem, we no longer need to conduct a linear search with O(n) time. Instead, we can use a binary search with O(log n) time.
- When using a linked-list, it is not possible to run a binary search due to the lack of indices in linked lists. Here, we will use a modified linear search instead that terminates after reaching the item or an itwm with a value greater than it.
- PutItem requires us to find the first index with a value greater than the item to be inserted. All elements including and after that index are shifted to the right. Finally, the necessary item is inserted at its proper location. This is O(n) because the search is O(n), the shift is O(n), and they are not nested loops
* 02.01.21 (Recursion)
** Recursion Trees
- To convert recurrences into a tree,
  - each node represents the cost incurred at various levels of recursion
  - Sum up the costs of all levels
- Complexity of a recursive function is determined by the amount of recursive calls
- To solve a recurrence relationship, we find a closed form for it or use a master method
* 01.28.21 (Algorithm Analysis)
** Experimental Analysis
- Algorithms = step-by-step procedure for solving a problem in a finite amount of time
- Experimentation Steps:
  - Write a program implementing the algorithm
  - Run the program with inputs of varying size, composition
  - Plot the results
- Limitations of Experiments:
  - Implementing the algorithm may be difficult
  - Results may not indicate running time on other inputs
  - Algorithm comparison is difficult
- For this reason, theoretical results are preferred
** Theoretical Analysis
- Theoretical Analysis
  - Use a high level description instead of an implementation
  - Characterizes running time as a function of input size, n
  - Takes into account all possible inputs
  - Allows for algorithm comparison independent of hardware/software
- Primitive Operations
  - Count the amount of primitive/basic operations
  - These operations are
    - identifiable in pseudocode
    - generally independent of programming language
    - want to focus on large operations such as loops
- Asymptotic Complexity
  - simply can be understood as Big-O
  - Generally fives us an idea of how rapidly the space/time requirements grow as problem size increases
- Rate of Growth
  - Because lower order terms become relatively insignificant for large n, we consider the actual function and its highest order term to have the same rate of growth
* 01.26.21 (ADTs & Big-O)
** Abstract Data Types
- Abstract Data Type (ADT): A data type whose properties are
- Require a domain and an operation, implementation not relevant at this point
- When implementation is considerd, an ADT becomes a data structure
** Data from 3 Different Levels
- Application (user) level - modeling real life data in a specific context (ex. Library of Congress)
- Logical (ADT) level - considering abstract understanding of necessary requirements (ex. Domain: Collection of Books, Operations: Check-in, Check-out, etc.)
- Implementation level - considering how to carry out operations upon the domain
** Basic Types of ADT Operations
- Constructor - creates a new instance of an ADT
- Transformer - changes the state of one or more of the data values of an instance
- Observer - allows us to observe the state of 1+ data value without changing them
- Iterator - allows us to process all the components in a data structure sequentially
** Composite Data Type
- Composite data types are types which
  - Store a collection of individual data components under one variable name
  - Allow the individual data components to be accessed
- Examples include arrays and classes
** Accessing Functions
- Accessing fucntions give the position of className[Index]
- Address(Index) = BaseAddress + Index * SizeOfElement
- Consider a base address of 6000 with a constant element size of 1 byte. Find the address of the 10th cell of this array.
  - 6000 + (10 * 1) = 6010;
