csci2720/notesMaster.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-02-09 Tue 12:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Data Structures</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Sudhan Chitgopkar" />
<link rel="stylesheet" type="text/css" href="rethink.css" />
</head>
<body>
<div id="content">
<h1 class="title">Data Structures</h1>
<div id="outline-container-orgc3fe8e5" class="outline-2">
<h2 id="orgc3fe8e5">02.08.21 - 02.09.21</h2>
<div class="outline-text-2" id="text-orgc3fe8e5">
</div>
<div id="outline-container-org5659e43" class="outline-3">
<h3 id="org5659e43">List ADT</h3>
<div class="outline-text-3" id="text-org5659e43">
<ul class="org-ul">
<li>List consists of a domain and a set of operations</li>
<li>Domain is composed of homogeneous elements</li>
<li>Elements should be able to be compared (comparison operation must be defined)</li>
<li>All elements except for the first and last elements have a predecessor and successor</li>
<li>Sorted lists are always implied to be sorted in ascending order</li>
<li>List operations
<ul class="org-ul">
<li>Constructor</li>
<li>Transformer: (changes state)
<ul class="org-ul">
<li>MakeEmpty, InsertItem,DeleteItem</li>
</ul></li>
<li>Observer: (obsesrve state)
<ul class="org-ul">
<li>IsFull, LengthIs, Min, Max, Average</li>
</ul></li>
<li>Iterator: GetNextItem (note that a ResetList is generally called before GetNextItem)</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgb39e224" class="outline-3">
<h3 id="orgb39e224">Generic Data Type</h3>
<div class="outline-text-3" id="text-orgb39e224">
<ul class="org-ul">
<li>A generic data type is a type for which the operations are defined but the types of the items being manipulated are not defined</li>
</ul>
</div>
</div>
<div id="outline-container-org754a3bb" class="outline-3">
<h3 id="org754a3bb">Efficient Operations in Unsorted Lists</h3>
<div class="outline-text-3" id="text-org754a3bb">
<ul class="org-ul">
<li><p>
When dealing with unsorted, array-based lists of a data-type,
</p>
<ul class="org-ul">
<li>insert operations should always be done at the end of the list through insert(length)
<ul class="org-ul">
<li>this is because inserting at the beginning requires us to push all items to the right one unit which is O(n), not O(1)</li>
</ul></li>
<li>delete operations should (1) find the element, (2) delete the element, and (3) move the last term to the index of the deleted term
<ul class="org-ul">
<li>this allows us to prevent moving through the array and refactoring it post-deletion</li>
</ul></li>
</ul>
<ul class="org-ul">
<li>Operation Complexity:
<ul class="org-ul">
<li>Search: O(n)</li>
<li>Insert: O(1)</li>
<li>Delete: O(n)</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgc4dd41a" class="outline-3">
<h3 id="orgc4dd41a">Efficient Operations in Sorted Lists</h3>
<div class="outline-text-3" id="text-orgc4dd41a">
<ul class="org-ul">
<li>GetItem, PutItem, and DeleteItem implementations change</li>
<li>For GetItem, we no longer need to conduct a linear search with O(n) time. Instead, we can use a binary search with O(log n) time.</li>
<li>When using a linked-list, it is not possible to run a binary search due to the lack of indices in linked lists. Here, we will use a modified linear search instead that terminates after reaching the item or an itwm with a value greater than it.</li>
<li>PutItem requires us to find the first index with a value greater than the item to be inserted. All elements including and after that index are shifted to the right. Finally, the necessary item is inserted at its proper location. This is O(n) because the search is O(n), the shift is O(n), and they are not nested loops</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd0fe768" class="outline-2">
<h2 id="orgd0fe768">02.01.21 (Recursion)</h2>
<div class="outline-text-2" id="text-orgd0fe768">
</div>
<div id="outline-container-org2535bfd" class="outline-3">
<h3 id="org2535bfd">Recursion Trees</h3>
<div class="outline-text-3" id="text-org2535bfd">
<ul class="org-ul">
<li>To convert recurrences into a tree,
<ul class="org-ul">
<li>each node represents the cost incurred at various levels of recursion</li>
<li>Sum up the costs of all levels</li>
</ul></li>
<li>Complexity of a recursive function is determined by the amount of recursive calls</li>
<li>To solve a recurrence relationship, we find a closed form for it or use a master method</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org01040ab" class="outline-2">
<h2 id="org01040ab">01.28.21 (Algorithm Analysis)</h2>
<div class="outline-text-2" id="text-org01040ab">
</div>
<div id="outline-container-org4eb252a" class="outline-3">
<h3 id="org4eb252a">Experimental Analysis</h3>
<div class="outline-text-3" id="text-org4eb252a">
<ul class="org-ul">
<li>Algorithms = step-by-step procedure for solving a problem in a finite amount of time</li>
<li>Experimentation Steps:
<ul class="org-ul">
<li>Write a program implementing the algorithm</li>
<li>Run the program with inputs of varying size, composition</li>
<li>Plot the results</li>
</ul></li>
<li>Limitations of Experiments:
<ul class="org-ul">
<li>Implementing the algorithm may be difficult</li>
<li>Results may not indicate running time on other inputs</li>
<li>Algorithm comparison is difficult</li>
</ul></li>
<li>For this reason, theoretical results are preferred</li>
</ul>
</div>
</div>
<div id="outline-container-orgb66dbd8" class="outline-3">
<h3 id="orgb66dbd8">Theoretical Analysis</h3>
<div class="outline-text-3" id="text-orgb66dbd8">
<ul class="org-ul">
<li>Theoretical Analysis
<ul class="org-ul">
<li>Use a high level description instead of an implementation</li>
<li>Characterizes running time as a function of input size, n</li>
<li>Takes into account all possible inputs</li>
<li>Allows for algorithm comparison independent of hardware/software</li>
</ul></li>
<li>Primitive Operations
<ul class="org-ul">
<li>Count the amount of primitive/basic operations</li>
<li>These operations are
<ul class="org-ul">
<li>identifiable in pseudocode</li>
<li>generally independent of programming language</li>
<li>want to focus on large operations such as loops</li>
</ul></li>
</ul></li>
<li>Asymptotic Complexity
<ul class="org-ul">
<li>simply can be understood as Big-O</li>
<li>Generally fives us an idea of how rapidly the space/time requirements grow as problem size increases</li>
</ul></li>
<li>Rate of Growth
<ul class="org-ul">
<li>Because lower order terms become relatively insignificant for large n, we consider the actual function and its highest order term to have the same rate of growth</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgfde62cc" class="outline-2">
<h2 id="orgfde62cc">01.26.21 (ADTs &amp; Big-O)</h2>
<div class="outline-text-2" id="text-orgfde62cc">
</div>
<div id="outline-container-org618b504" class="outline-3">
<h3 id="org618b504">Abstract Data Types</h3>
<div class="outline-text-3" id="text-org618b504">
<ul class="org-ul">
<li>Abstract Data Type (ADT): A data type whose properties are</li>
<li>Require a domain and an operation, implementation not relevant at this point</li>
<li>When implementation is considerd, an ADT becomes a data structure</li>
</ul>
</div>
</div>
<div id="outline-container-org4375f8a" class="outline-3">
<h3 id="org4375f8a">Data from 3 Different Levels</h3>
<div class="outline-text-3" id="text-org4375f8a">
<ul class="org-ul">
<li>Application (user) level - modeling real life data in a specific context (ex. Library of Congress)</li>
<li>Logical (ADT) level - considering abstract understanding of necessary requirements (ex. Domain: Collection of Books, Operations: Check-in, Check-out, etc.)</li>
<li>Implementation level - considering how to carry out operations upon the domain</li>
</ul>
</div>
</div>
<div id="outline-container-org1dfec84" class="outline-3">
<h3 id="org1dfec84">Basic Types of ADT Operations</h3>
<div class="outline-text-3" id="text-org1dfec84">
<ul class="org-ul">
<li>Constructor - creates a new instance of an ADT</li>
<li>Transformer - changes the state of one or more of the data values of an instance</li>
<li>Observer - allows us to observe the state of 1+ data value without changing them</li>
<li>Iterator - allows us to process all the components in a data structure sequentially</li>
</ul>
</div>
</div>
<div id="outline-container-org291a38d" class="outline-3">
<h3 id="org291a38d">Composite Data Type</h3>
<div class="outline-text-3" id="text-org291a38d">
<ul class="org-ul">
<li>Composite data types are types which
<ul class="org-ul">
<li>Store a collection of individual data components under one variable name</li>
<li>Allow the individual data components to be accessed</li>
</ul></li>
<li>Examples include arrays and classes</li>
</ul>
</div>
</div>
<div id="outline-container-orgbb9f9f3" class="outline-3">
<h3 id="orgbb9f9f3">Accessing Functions</h3>
<div class="outline-text-3" id="text-orgbb9f9f3">
<ul class="org-ul">
<li>Accessing fucntions give the position of className[Index]</li>
<li>Address(Index) = BaseAddress + Index * SizeOfElement</li>
<li>Consider a base address of 6000 with a constant element size of 1 byte. Find the address of the 10th cell of this array.
<ul class="org-ul">
<li>6000 + (10 * 1) = 6010;</li>
</ul></li>
</ul>
</div>
</div>
