csci2720/notesMaster.org
** Order of Magnitude of a Function
- Order of magnitude (Big-O notation) expresses computing time of a problem as the term in a function that increases the most rapodly relative to the size of the problem
- Consider two algorithms, A and B. They are both used to solve the same class of problems.
  - A has time complexity 5,000n
  - B has time complexity 1.1^{n}
- Here, A is more efficient because it is linear, rather than exponential - which is preferable for large n
- Order of growth and time complexity are inverses (larger growth rate = slower time to execute)
- All functions are monotonic (continue increasing indefinitely)
* 01.25.21 (File I/O)
- File I/O ex.
 #+BEGIN_SRC cpp
#include <fstream>

int main () {
  //opens file
  ifstream inClientFile("clients.dat", ios::in);

  //exits if file can't be opened
  if (!inClientFile) {
    cerr << "File could not be opened" << endl;
    exit(1);
  } //if

  //var declarations
  int account;
  string name;
  double balance;

 // displays each record in the file
 while (inClientFile >> account >> name >> balance) {
   outputLine(account,name,balance);
 } //while

}
  #+END_SRC
* 01.25.21 (C++ Ch. 9)
** Pass by Reference
- When dealing with very large objects, don't pass by copy due to the large overhead of copying. Instead, pass by reference
- When passing by reference, use const if you don't want to modify the data members
** Destructors
- Name of destructor is className~
- Called implicitly when an object is destroyed
- Takes no parameters, returns no value
- No return type allowed in signature, not even void
- Only one destructor allowed per class
- Must be public
- Destructors are called once a variable exits its scope
- Static variables are destroyed after local variables, with global variables destroyed last
- Objects are also destroyed in reverse order from their construction
** Const Objects
- const objects must use const methods only
- non-const objects may use both non-const and const methods
* 01.21.21 (C++ Ch. 9)
** Encapsulation
- Header files should not contain source code, it should only include prototypes in order to ensure proper information-hiding
- Source code should be placed in a different cpp file, which pulls from the prototypes in the header file
** Include Guards
- Consider the following classes: Student, Course, and Main
  - Student uses Course
  - Main uses Student and Course
  - The main method would then look like:
  #+BEGIN_SRC cpp
  #include "student.h"
  #include "course.h"
  #+END_SRC
  - student.h compiles properly, but an error is thrown when course.h tries to be included because it has already been included through Student.
  - To fix this, use header guards, as follows:
  #+BEGIN_SRC cpp
  #ifndef FILENAME_H
  #define FILENAME_H
  #+END_SRC
- Include guards ensure that a prototype is not defined twice
- The header guard should be put in header files that are used in multiple places
** Writing Classes
- Begin by including the necessary header file
- All methods and constructors must be preceded by the header file name and the scope resolution operator (::)
** Constructors & Default Constructors
- Constructors can call other methods and do data-checking
- Constructors can be called explicit with multiple parameters when the parameters are impossible to typecast, as follows:
#+BEGIN_SRC cpp
int main () {
  explicit Time t (x = 0, y = 0, z = 0);
} //main
#+END_SRC
* 01.21.21 (C++ Ch. 3)
** Objects and Object Sizes
- An objects size will always be the sum of its data members. The size will not be affected by any methods that are called upon it.
- Because of this, objects can quickly become very large in size.
** UML Diagrams
- Classes are listed as individual boxes
  - top box = class name
  - middle compartment = data members : data type
  - bottom compartment - methods and parameters
    - - = private
    - + = public
    - # = protected
** Constructors
- Explicit constructors can be used to prevent implicit typecasting, as seen below:
#+BEGIN_SRC cpp
class Student {
  Student (int s) {

  } //constructor
} //Student

int main () {
  Student s {15}; //allowed, completes correctly
  Student c {'C'}; //typecasts automatically, should not occur
  //Note, () can be used in place of {} to construct objects
}
#+END_SRC

- Ex. list initialization with an explicit constructor
#+BEGIN_SRC cpp
explicit Account (std::string accountName) //explicit constructor
  : name{accountName} {
  //insert constructor code here
  }
#+END_SRC
