csci2720/notesMaster.html
<div id="outline-container-org979400a" class="outline-3">
<h3 id="org979400a">Order of Magnitude of a Function</h3>
<div class="outline-text-3" id="text-org979400a">
<ul class="org-ul">
<li>Order of magnitude (Big-O notation) expresses computing time of a problem as the term in a function that increases the most rapodly relative to the size of the problem</li>
<li>Consider two algorithms, A and B. They are both used to solve the same class of problems.
<ul class="org-ul">
<li>A has time complexity 5,000n</li>
<li>B has time complexity 1.1<sup>n</sup></li>
</ul></li>
<li>Here, A is more efficient because it is linear, rather than exponential - which is preferable for large n</li>
<li>Order of growth and time complexity are inverses (larger growth rate = slower time to execute)</li>
<li>All functions are monotonic (continue increasing indefinitely)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org5f727ed" class="outline-2">
<h2 id="org5f727ed">01.25.21 (File I/O)</h2>
<div class="outline-text-2" id="text-org5f727ed">
<ul class="org-ul">
<li><p>
File I/O ex.
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #51afef; font-weight: bold;">#include</span> <span style="color: #99bb66;">&lt;fstream&gt;</span>

<span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">main</span> () {
  <span style="color: #525252;">//</span><span style="color: #525252;">opens file</span>
  <span style="color: #ECBE7B;">ifstream</span> <span style="color: #dcaeea;">inClientFile</span>(<span style="color: #99bb66;">"clients.dat"</span>, <span style="color: #a9a1e1;">ios</span>::in);

  <span style="color: #525252;">//</span><span style="color: #525252;">exits if file can't be opened</span>
  <span style="color: #51afef;">if</span> (<span style="color: #51afef; font-weight: bold;">!</span>inClientFile) {
    cerr &lt;&lt; <span style="color: #99bb66;">"File could not be opened"</span> &lt;&lt; endl;
    exit(<span style="color: #dd8844; font-weight: bold;">1</span>);
  } <span style="color: #525252;">//</span><span style="color: #525252;">if</span>

  <span style="color: #525252;">//</span><span style="color: #525252;">var declarations</span>
  <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">account</span>;
  <span style="color: #ECBE7B;">string</span> <span style="color: #dcaeea;">name</span>;
  <span style="color: #ECBE7B;">double</span> <span style="color: #dcaeea;">balance</span>;

 <span style="color: #525252;">// </span><span style="color: #525252;">displays each record in the file</span>
 <span style="color: #51afef;">while</span> (inClientFile &gt;&gt; account &gt;&gt; name &gt;&gt; balance) {
   outputLine(account,name,balance);
 } <span style="color: #525252;">//</span><span style="color: #525252;">while</span>

}
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-orge436fc2" class="outline-2">
<h2 id="orge436fc2">01.25.21 (C++ Ch. 9)</h2>
<div class="outline-text-2" id="text-orge436fc2">
</div>
<div id="outline-container-orgb773f70" class="outline-3">
<h3 id="orgb773f70">Pass by Reference</h3>
<div class="outline-text-3" id="text-orgb773f70">
<ul class="org-ul">
<li>When dealing with very large objects, don&rsquo;t pass by copy due to the large overhead of copying. Instead, pass by reference</li>
<li>When passing by reference, use const if you don&rsquo;t want to modify the data members</li>
</ul>
</div>
</div>
<div id="outline-container-orgaa39a69" class="outline-3">
<h3 id="orgaa39a69">Destructors</h3>
<div class="outline-text-3" id="text-orgaa39a69">
<ul class="org-ul">
<li>Name of destructor is className~</li>
<li>Called implicitly when an object is destroyed</li>
<li>Takes no parameters, returns no value</li>
<li>No return type allowed in signature, not even void</li>
<li>Only one destructor allowed per class</li>
<li>Must be public</li>
<li>Destructors are called once a variable exits its scope</li>
<li>Static variables are destroyed after local variables, with global variables destroyed last</li>
<li>Objects are also destroyed in reverse order from their construction</li>
</ul>
</div>
</div>
<div id="outline-container-orge2d0eae" class="outline-3">
<h3 id="orge2d0eae">Const Objects</h3>
<div class="outline-text-3" id="text-orge2d0eae">
<ul class="org-ul">
<li>const objects must use const methods only</li>
<li>non-const objects may use both non-const and const methods</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org4c8b939" class="outline-2">
<h2 id="org4c8b939">01.21.21 (C++ Ch. 9)</h2>
<div class="outline-text-2" id="text-org4c8b939">
</div>
<div id="outline-container-org46f83d7" class="outline-3">
<h3 id="org46f83d7">Encapsulation</h3>
<div class="outline-text-3" id="text-org46f83d7">
<ul class="org-ul">
<li>Header files should not contain source code, it should only include prototypes in order to ensure proper information-hiding</li>
<li>Source code should be placed in a different cpp file, which pulls from the prototypes in the header file</li>
</ul>
</div>
</div>
<div id="outline-container-org5859c8e" class="outline-3">
<h3 id="org5859c8e">Include Guards</h3>
<div class="outline-text-3" id="text-org5859c8e">
<ul class="org-ul">
<li><p>
Consider the following classes: Student, Course, and Main
</p>
<ul class="org-ul">
<li>Student uses Course</li>
<li>Main uses Student and Course</li>
<li>The main method would then look like:</li>
</ul>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #51afef; font-weight: bold;">  #include</span> <span style="color: #99bb66;">"student.h"</span>
<span style="color: #51afef; font-weight: bold;">  #include</span> <span style="color: #99bb66;">"course.h"</span>
</pre>
</div>
<ul class="org-ul">
<li>student.h compiles properly, but an error is thrown when course.h tries to be included because it has already been included through Student.</li>
<li>To fix this, use header guards, as follows:</li>
</ul>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #51afef; font-weight: bold;">  #if</span><span style="color: #51afef; font-weight: bold;">n</span><span style="color: #51afef; font-weight: bold;">def</span> FILENAME_H
<span style="color: #51afef; font-weight: bold;">  #define</span> <span style="color: #dcaeea;">FILENAME_H</span>
</pre>
</div></li>
<li>Include guards ensure that a prototype is not defined twice</li>
<li>The header guard should be put in header files that are used in multiple places</li>
</ul>
</div>
</div>
<div id="outline-container-orgc94a4af" class="outline-3">
<h3 id="orgc94a4af">Writing Classes</h3>
<div class="outline-text-3" id="text-orgc94a4af">
<ul class="org-ul">
<li>Begin by including the necessary header file</li>
<li>All methods and constructors must be preceded by the header file name and the scope resolution operator (::)</li>
</ul>
</div>
</div>
<div id="outline-container-orgc55a75d" class="outline-3">
<h3 id="orgc55a75d">Constructors &amp; Default Constructors</h3>
<div class="outline-text-3" id="text-orgc55a75d">
<ul class="org-ul">
<li>Constructors can call other methods and do data-checking</li>
<li>Constructors can be called explicit with multiple parameters when the parameters are impossible to typecast, as follows:</li>
</ul>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">main</span> () {
  <span style="color: #51afef;">explicit</span> <span style="color: #ECBE7B;">Time</span> <span style="color: #dcaeea;">t</span> (x = <span style="color: #dd8844; font-weight: bold;">0</span>, y = <span style="color: #dd8844; font-weight: bold;">0</span>, z = <span style="color: #dd8844; font-weight: bold;">0</span>);
} <span style="color: #525252;">//</span><span style="color: #525252;">main</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org20d018a" class="outline-2">
<h2 id="org20d018a">01.21.21 (C++ Ch. 3)</h2>
<div class="outline-text-2" id="text-org20d018a">
</div>
<div id="outline-container-orgcd10e46" class="outline-3">
<h3 id="orgcd10e46">Objects and Object Sizes</h3>
<div class="outline-text-3" id="text-orgcd10e46">
<ul class="org-ul">
<li>An objects size will always be the sum of its data members. The size will not be affected by any methods that are called upon it.</li>
<li>Because of this, objects can quickly become very large in size.</li>
</ul>
</div>
</div>
<div id="outline-container-orgd21b933" class="outline-3">
<h3 id="orgd21b933">UML Diagrams</h3>
<div class="outline-text-3" id="text-orgd21b933">
<ul class="org-ul">
<li>Classes are listed as individual boxes
<ul class="org-ul">
<li>top box = class name</li>
<li>middle compartment = data members : data type</li>
<li>bottom compartment - methods and parameters
<ul class="org-ul">
<li>- = private</li>
<li>+ = public</li>
<li># = protected</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org8f8d54c" class="outline-3">
<h3 id="org8f8d54c">Constructors</h3>
<div class="outline-text-3" id="text-org8f8d54c">
<ul class="org-ul">
<li>Explicit constructors can be used to prevent implicit typecasting, as seen below:</li>
</ul>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">Student</span> {
  <span style="color: #c678dd;">Student</span> (<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">s</span>) {

  } <span style="color: #525252;">//</span><span style="color: #525252;">constructor</span>
} <span style="color: #525252;">//</span><span style="color: #525252;">Student</span>

<span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">main</span> () {
  <span style="color: #ECBE7B;">Student</span> <span style="color: #dcaeea;">s</span> {<span style="color: #dd8844; font-weight: bold;">15</span>}; <span style="color: #525252;">//</span><span style="color: #525252;">allowed, completes correctly</span>
  <span style="color: #ECBE7B;">Student</span> <span style="color: #dcaeea;">c</span> {<span style="color: #99bb66;">'C'</span>}; <span style="color: #525252;">//</span><span style="color: #525252;">typecasts automatically, should not occur</span>
  <span style="color: #525252;">//</span><span style="color: #525252;">Note, () can be used in place of {} to construct objects</span>
}
</pre>
</div>

<ul class="org-ul">
<li>Ex. list initialization with an explicit constructor</li>
</ul>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #51afef;">explicit</span> <span style="color: #c678dd;">Account</span> (<span style="color: #a9a1e1;">std</span>::<span style="color: #ECBE7B;">string</span> <span style="color: #dcaeea;">accountName</span>) <span style="color: #525252;">//</span><span style="color: #525252;">explicit constructor</span>
  : name{accountName} {
  <span style="color: #525252;">//</span><span style="color: #525252;">insert constructor code here</span>
  }
</pre>
</div>
</div>
</div>
</div>
