csci2720/notesMaster.html
<div id="outline-container-org4b391f1" class="outline-2">
<h2 id="org4b391f1">01.19.21 (C++ Ch. 3)</h2>
<div class="outline-text-2" id="text-org4b391f1">
<p>
A look at class creation
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #51afef; font-weight: bold;">#include</span> <span style="color: #99bb66;">&lt;iostream&gt;</span>
<span style="color: #51afef;">using</span> <span style="color: #51afef;">namespace</span> <span style="color: #a9a1e1;">std</span>;

<span style="color: #525252;">//</span><span style="color: #525252;">defining the class</span>
<span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">GradeBook</span> {
  <span style="color: #525252;">//</span><span style="color: #525252;">holds all public vars, functions</span>
  <span style="color: #51afef;">public</span>:
  <span style="color: #525252;">//</span><span style="color: #525252;">public function</span>
  <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">displayMessage</span>() {
    cout &lt;&lt; <span style="color: #99bb66;">"Welcome to your Gradebook"</span> &lt;&lt; endl;
  } <span style="color: #525252;">//</span><span style="color: #525252;">displayMesage</span>
} <span style="color: #525252;">//</span><span style="color: #525252;">GradeBook</span>

<span style="color: #525252;">//</span><span style="color: #525252;">main method</span>
<span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">main</span> () {
  <span style="color: #525252;">//</span><span style="color: #525252;">creates a GradeBook object</span>
  <span style="color: #ECBE7B;">GradeBook</span> <span style="color: #dcaeea;">myGradeBook</span>;
  <span style="color: #525252;">//</span><span style="color: #525252;">calls above created function on object</span>
  myGradeBook.displayMessage();
}
</pre>
</div>

<ul class="org-ul">
<li>Class functions and vars are, by default, private. The public keyword must be used to denote any public parts of a class.</li>

<li>Move implementations to a header file for use in main methods while separating out each file.</li>

<li>When using header files, use quotation marks around them to indicate that they&rsquo;re a file on your machine. Use angle brackets around things to include form the C std lib.</li>

<li>The purpose of const functions is to prevent the function from modifying the values of data members or objects.</li>
</ul>
</div>
</div>

<div id="outline-container-org133b77d" class="outline-2">
<h2 id="org133b77d">01.19.21 (C++ Ch. 2)</h2>
<div class="outline-text-2" id="text-org133b77d">
<p>
A look at some basic C++ code
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #51afef; font-weight: bold;">#include</span> <span style="color: #99bb66;">&lt;iostream&gt;</span> <span style="color: #525252;">//</span><span style="color: #525252;">enables program to output data</span>

<span style="color: #525252;">//</span><span style="color: #525252;">main function begins program execution</span>
<span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">main</span> () {
  <span style="color: #525252;">//</span><span style="color: #525252;">cout currently a function as a part of the std namespace</span>
  <span style="color: #a9a1e1;">std</span>::cout &lt;&lt; <span style="color: #99bb66;">"Welcome to C++!\n"</span>;
  <span style="color: #525252;">//</span><span style="color: #525252;">above &lt;&lt; is an insertion operator, overloaded from the bitwise left-shift</span>

  <span style="color: #51afef;">return</span> <span style="color: #dd8844; font-weight: bold;">0</span>;
}
</pre>
</div>

<p>
A look at some higher level C++ code
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #51afef; font-weight: bold;">#include</span> <span style="color: #99bb66;">&lt;iostream&gt;</span>

<span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">main</span> () {

  <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">num1</span>{<span style="color: #dd8844; font-weight: bold;">0</span>}; <span style="color: #525252;">//</span><span style="color: #525252;">list initialization</span>
  <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">num2</span> = <span style="color: #dd8844; font-weight: bold;">0</span>; <span style="color: #525252;">//</span><span style="color: #525252;">regular initialization</span>
 <span style="color: #525252;">//</span><span style="color: #525252;">No difference between list &amp; regular initializtion with primitive types.</span>
 <span style="color: #525252;">//</span><span style="color: #525252;">List initialization should be used for UDTs.</span>

  <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">sum</span>{<span style="color: #dd8844; font-weight: bold;">0</span>}

  <span style="color: #a9a1e1;">std</span>::cin &gt;&gt; num1;
  <span style="color: #a9a1e1;">std</span>::cin &gt;&gt; num2;

  sum = num1 + num2;

  <span style="color: #a9a1e1;">std</span>::cout &lt;&lt; sum &lt;&lt; <span style="color: #a9a1e1;">std</span>::endl;
  <span style="color: #525252;">//</span><span style="color: #525252;">endl is helpful because it flushes the buffer</span>
  <span style="color: #525252;">//</span><span style="color: #525252;">newline character does not</span>
  <span style="color: #51afef;">return</span> <span style="color: #dd8844; font-weight: bold;">0</span>;
}
</pre>
</div>

<p>
A look at a common mistake
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #51afef; font-weight: bold;">#include</span> <span style="color: #99bb66;">&lt;iostream&gt;</span>

<span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">main</span> () {
  <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">x</span> {<span style="color: #dd8844; font-weight: bold;">5</span>};

  <span style="color: #51afef;">if</span>(x &gt; <span style="color: #dd8844; font-weight: bold;">10</span>); {
    <span style="color: #a9a1e1;">std</span>::cout &lt;&lt; x <span style="color: #99bb66;">"&gt; 10"</span> &lt;&lt; <span style="color: #a9a1e1;">std</span>::endl;
  }
  <span style="color: #525252;">//</span><span style="color: #525252;">still prints output because of semicolon after if statement</span>

  <span style="color: #51afef;">return</span> <span style="color: #dd8844; font-weight: bold;">0</span>;
}
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Sudhan Chitgopkar</p>
<p class="date">Created: 2021-02-09 Tue 12:20</p>
</div>
</body>
</html>
